[
  {
    "id": "1",
    "blogId": "1",
    "blogImage": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=800&q=60",
    "blogDate": "2023-10-01",
    "blogTitle": "India's Vision for the Future",
    "blogDescription": "How can India truly unite and move forward, not just economically but as a civilization with shared purpose?",
    "content": "In 1857–1947, India had one dream, one direction — Freedom. Every child, elder, farmer, poet, soldier, and scientist lived for it. Today, India is free — but it’s waiting for the next shared dream. Everyone is running, but no one knows where we are going. Every child becomes a problem-solver, not a rote memorizer. Every village becomes energy-rich, job-rich, and knowledge-rich. Rivers flow clean. Air is breathable. Forests and farms thrive together. Technology is used not to addict people — but to uplift people. We don’t just talk about dharma — we program it into how we govern. And above all, we aim not just for Mars or Moon… but for meaning."
  },
  {
    "id": "2",
    "blogId": "2",
    "blogImage": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=800&q=60",
    "blogDate": "2023-11-01",
    "blogTitle": "Ernesto Che Guevara",
    "blogDescription": "Ernesto Che Guevara was an Argentine Marxist revolutionary, physician, author, guerrilla leader and diplomat.",
    "content": "Che Guevara, born in Rosario, Argentina, in 1928, was a key figure in the Cuban Revolution alongside Fidel Castro. After studying medicine, he traveled across South America, witnessing poverty and injustice, which shaped his revolutionary ideals. Guevara played a crucial role in the Cuban government post-revolution but later left to incite revolutions in Africa and Bolivia. He was captured and executed by the Bolivian army in 1967. His image and writings continue to inspire leftist movements worldwide, symbolizing resistance against imperialism and social injustice."
  }
]